# Part 1

In [30]:
import pandas as pd
url = 'https://simple.wikipedia.org/wiki/List_of_U.S._states_by_traditional_abbreviation'

In [33]:
print("Ex 3.8 Part 1")
df = pd.read_html(url)
df = df[0]
df.drop(columns=['Traditional abbreviation'], inplace=True)
df.rename(columns={'State': 'State_Name', 'Other abbreviations': 'State_Abbr'}, inplace=True)
print(df.shape)
df.head()

Ex 3.8 Part 1
(51, 2)

   State_Name State_Abbr
0     Alabama         AL
1      Alaska         AK
2     Arizona         AZ
3    Arkansas         AR
4  California         CA

# Part 2

In [28]:
df_employees = pd.DataFrame(
[
[1699,'  Robinson, David  ','  david22@adventure-works.com  ', '(827) 525-0100', '06-05-2010', '$80,950'], 
[1700,'  Robinson, Rebecca  ','  rebecca5 @adventure-works.com  ', '(829) 525-0101', '05-01-2015', '$70,950'],
[1701,'     Robinson, Dorothy    ','  dorothy3@adventure-works.com    ', '(828) 555-0102', '03-01-2017', '$50,00'],
], 
columns=['BusinessEntityID', 'EmployeeName','EmailAddress', 'PhoneNumber', 'StartDate', 'CurrentSalary'])
	  
df_employees

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary
0,1699,"Robinson, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,"$80,950"
1,1700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,"$70,950"
2,1701,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,"$50,00"

In [ ]:
print("Ex 3.8 Part 2")
df_employees.drop(columns=['BusinessEntityID'], inplace=True)
df_employees.rename(columns={'EmployeeName':'Emp_Name', 'EmailAddress':'Emp_Email', 'PhoneNumber':'Emp_Phone', 'StartDate':'Emp_Start', 'CurrentSalary':'Emp_Salary'}, inplace=True)
df_employees

Ex 3.8 Part 2

,Emp_Name,Emp_Email,Emp_Phone,Emp_Start,Emp_Salary
0,"Robinson, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,"$80,950"
1,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,"$70,950"
2,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,"$50,00"